{
  "rows": [
    {
      "revenue_line": "Server products and cloud services",
      "description": "Server products and cloud services revenue includes sales from Azure and other cloud services, as well as server products, and is part of the Intelligent Cloud segment. This revenue line is driven by demand for Microsoft's portfolio of cloud and server offerings.",
      "products_services": [
        "Azure",
        "Server",
        "Cloud"
      ],
      "evidence_chunk_ids": [
        "chunk_0283",
        "chunk_0306"
      ],
      "retrieval_tier": "tier2_full",
      "validated": true
    },
    {
      "revenue_line": "Microsoft 365 Commercial products and cloud services",
      "description": "Microsoft 365 Commercial products and cloud services revenue includes sales of Microsoft 365 Commercial cloud offerings and related products, driven by seat growth in small and medium businesses, frontline worker offerings, and increased revenue per user, as well as on-premises components and Office transactional sales.",
      "products_services": [
        "Microsoft 365 Commercial cloud",
        "Office",
        "Windows Commercial"
      ],
      "evidence_chunk_ids": [
        "chunk_0283",
        "chunk_0304",
        "chunk_0508"
      ],
      "retrieval_tier": "tier2_full",
      "validated": true
    },
    {
      "revenue_line": "Gaming",
      "description": "Gaming revenue within the More Personal Computing segment includes revenue from Xbox content and services, comprising first- and third-party content (including games and in-game content), Xbox Game Pass and other subscriptions, and Xbox Cloud Gaming.",
      "products_services": [
        "Gaming"
      ],
      "evidence_chunk_ids": [
        "chunk_0299"
      ],
      "retrieval_tier": "tier2_full",
      "validated": true
    },
    {
      "revenue_line": "LinkedIn",
      "description": "LinkedIn connects the world’s professionals to make them more productive and successful and transforms the way companies hire, market, sell, and learn. LinkedIn revenue includes offerings that support professional networking, hiring, marketing, sales, and learning solutions.",
      "products_services": [
        "LinkedIn"
      ],
      "evidence_chunk_ids": [
        "chunk_0078",
        "chunk_0507",
        "chunk_0283"
      ],
      "retrieval_tier": "tier2_full",
      "validated": true
    },
    {
      "revenue_line": "Windows and Devices",
      "description": "Windows and Devices revenue includes sales of Windows Pro and non-Pro licenses sold through the OEM channel and sales of first-party Devices, including Surface and PC accessories.",
      "products_services": [
        "OEM",
        "Devices"
      ],
      "evidence_chunk_ids": [
        "chunk_0299",
        "chunk_0507"
      ],
      "retrieval_tier": "tier2_full",
      "validated": true
    },
    {
      "revenue_line": "Search and news advertising",
      "description": "Search and news advertising revenue consists of sales from online advertising, including advertising on Microsoft's search and news platforms, and is part of the More Personal Computing segment.",
      "products_services": [
        "Search"
      ],
      "evidence_chunk_ids": [
        "chunk_0301",
        "chunk_0507",
        "chunk_0375"
      ],
      "retrieval_tier": "tier2_full",
      "validated": true
    },
    {
      "revenue_line": "Dynamics products and cloud services",
      "description": "Dynamics products and cloud services revenue includes revenue from Microsoft's Dynamics business solutions, with growth primarily driven by Dynamics 365.",
      "products_services": [
        "Dynamics",
        "Dynamics 365"
      ],
      "evidence_chunk_ids": [
        "chunk_0283"
      ],
      "retrieval_tier": "tier2_full",
      "validated": true
    },
    {
      "revenue_line": "Enterprise and partner services",
      "description": "Enterprise and partner services revenue includes services provided to enterprise customers and partners, as classified separately from product and cloud service revenues in Microsoft's financial reporting.",
      "products_services": [],
      "evidence_chunk_ids": [
        "chunk_0507"
      ],
      "retrieval_tier": "tier2_full",
      "validated": true
    },
    {
      "revenue_line": "Microsoft 365 Consumer products and cloud services",
      "description": "Microsoft 365 Consumer products and cloud services revenue includes revenue from Microsoft 365 Consumer subscriptions, Office Consumer products, and is influenced by demand for communication and storage services such as Outlook.com and OneDrive, as well as the shift from Office licensed on-premises to cloud-based subscriptions.",
      "products_services": [
        "Office",
        "Office Consumer",
        "Microsoft 365 Consumer products and cloud services",
        "Outlook",
        "OneDrive"
      ],
      "evidence_chunk_ids": [
        "chunk_0078"
      ],
      "retrieval_tier": "tier2_full",
      "validated": true
    },
    {
      "revenue_line": "Other",
      "description": "The 'Other' revenue line includes revenue not classified under the company's significant product and service offerings, representing a small portion of total revenue.",
      "products_services": [
        "Other"
      ],
      "evidence_chunk_ids": [
        "chunk_0507"
      ],
      "retrieval_tier": "tier2_full",
      "validated": true
    }
  ]
}