{
  "rows": [
    {
      "revenue_line": "iPhone",
      "description": "iPhone revenue includes net sales from Apple's iPhone products, with increases in 2025 primarily due to higher sales of Pro models. This revenue line reflects the sales of iPhone devices as reported in the company's disaggregated net sales tables.",
      "products_services": [
        "iPhone"
      ],
      "evidence_chunk_ids": [
        "chunk_0207",
        "chunk_0261",
        "chunk_0262"
      ],
      "retrieval_tier": "tier2_full",
      "validated": true
    },
    {
      "revenue_line": "Mac",
      "description": "The Mac revenue line includes net sales from the Company's line of Mac computers, such as MacBook Pro, Mac mini, iMac, MacBook Air, and Mac Studio, as announced during the fiscal year.",
      "products_services": [
        "MacBook",
        "Mac Studio Third Quarter"
      ],
      "evidence_chunk_ids": [
        "chunk_0200"
      ],
      "retrieval_tier": "tier2_full",
      "validated": true
    },
    {
      "revenue_line": "iPad",
      "description": "The iPad revenue line includes net sales from various iPad models, with increases in 2025 primarily driven by higher net sales of iPad Air, iPad mini, and iPad, partially offset by lower net sales of iPad Pro.",
      "products_services": [
        "iPad"
      ],
      "evidence_chunk_ids": [
        "chunk_0208"
      ],
      "retrieval_tier": "tier2_full",
      "validated": true
    },
    {
      "revenue_line": "Wearables, Home and Accessories",
      "description": "Wearables, Home and Accessories net sales include revenue from Apple's wearable devices, home products, and related accessories. Net sales in this category decreased during 2025 compared to 2024 primarily due to lower net sales of Accessories and Wearables.",
      "products_services": [
        "Accessories",
        "Wearables"
      ],
      "evidence_chunk_ids": [
        "chunk_0208"
      ],
      "retrieval_tier": "tier2_full",
      "validated": true
    },
    {
      "revenue_line": "Services (1)",
      "description": "Services net sales include amortization of the deferred value of services bundled in the sales price of certain products, and are driven by revenue from sources such as advertising, the App Store, and cloud services.",
      "products_services": [
        "App Store",
        "amortization of the deferred value of ser"
      ],
      "evidence_chunk_ids": [
        "chunk_0261",
        "chunk_0207",
        "chunk_0209"
      ],
      "retrieval_tier": "tier2_full",
      "validated": true
    }
  ]
}